[
  {
    "lessonPlan": {
      "lesson": "Week 1 Lesson 1",
      "date": "5 November 2024",
      "time": "13:00-13:50",
      "topic": "Places",
      "vocabulary": "Geographical features",
      "grammar": "The superlative",
      "listeningSpeaking": "Talk about extreme places",
      "writing": "A quiz about places in the world",
      "lessonObjective": "By the end of the lesson, students will be able to use superlatives to describe and compare geographical places and features around the world, and discuss the most extreme places using vocabulary related to geographical features.",

      "stages": [
        {
          "stage": "Warmup",
          "procedure": "Students will be asked about different types of geography-related places, such as mountains, rivers, and deserts. The teacher will show pictures of famous locations (e.g., Mount Everest, Sahara Desert), and ask students which ones they know or where they are from.",
          "timing": "5 minutes",
          "materials": "Projector or printed pictures of famous geographical features"
        },
        {
          "stage": "Introduction",
          "procedure": "The teacher will introduce the topic of 'Places' by connecting it to the superlatives. Using examples from the warmup (e.g., 'Mount Everest is the tallest mountain in the world'), the teacher will explain how superlatives are formed and used to compare things. For example, 'ever' has the superlative 'tallest'.",
          "timing": "8 minutes",
          "materials": "Whiteboard, markers, examples of superlative sentences"
        },
        {
          "stage": "Practice Activity",
          "procedure": "In pairs, students will be given a list of geographical features (e.g., mountains, rivers, lakes, deserts) and they will work together to rank them using superlatives like 'the longest', 'the highest', 'the hottest', etc.",
          "timing": "10 minutes",
          "materials": "Worksheet with geographical feature names and blank spaces for rankings"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "Students will listen to short descriptions of famous extreme places from an audio track (e.g., 'the hottest desert', 'the tallest peak') and write the correct superlative (e.g., 'hottest', 'tallest') they hear in the descriptions.",
          "timing": "10 minutes",
          "materials": "Audio track describing places, worksheet for students to complete the sentences"
        },
        {
          "stage": "Review",
          "procedure": "The teacher reviews the answers for the superlative form from the listening activity and clarifies any common mistakes. The class discusses why superlatives are used and reviews geographical terms.",
          "timing": "7 minutes",
          "materials": "Answer key, additional notes on superlatives"
        },
        {
          "stage": "Closing",
          "procedure": "Students will have a short discussion in small groups about 'extreme places' using what they have learned. The teacher will ask: 'What is the most interesting extreme place?' Each group shares back with the class.",
          "timing": "8 minutes",
          "materials": "None"
        },
        {
          "stage": "Homework",
          "procedure": "Students will be assigned a short writing task to create a 'world quiz' that asks questions about different extreme places (using superlative forms and geographical vocabulary). For example, 'What is the tallest mountain?'",
          "timing": "2 minutes",
          "materials": "Homework handout"
        }
      ]
    }
  },
  {
    "lessonPlan": {
      "lesson": "Week 1 Lesson 2",
      "date": "8 November 2024",
      "time": "13:50-14:40",
      "topic": "Cities",
      "vocabulary": "Places in a city",
      "grammar": "Comparative and superlative adjectives, pronunciation of /h/",
      "listeningSpeaking": "Make comparisons",
      "writing": "A short email about a city in your country",
      "lessonObjective": "By the end of this lesson, students will be able to use comparative and superlative structures to describe and compare different cities while expanding their vocabulary related to places in cities. They will also practice pronunciation of the /h/ sound and improve their listening and speaking skills through making comparisons.",
      "stages": [
        {
          "stage": "Warmup",
          "procedure": "Start with a quick brainstorming activity. Ask students to list as many places in a city as they can in 2 minutes. Then, have them share their answers with the class and categorize them (e.g., public places, recreational spots, transportation hubs).",
          "timing": "5 minutes",
          "materials": "Whiteboard, markers"
        },
        {
          "stage": "Introduction",
          "procedure": "Introduce the topic: 'Cities.' Present a slideshow or visual aid with images of different cities. Discuss the key vocabulary for places in a city (e.g., park, museum, subway, skyscraper). Introduce the grammar point—comparative and superlative forms (e.g., bigger, biggest). Provide a few comparison examples using cities. Also, review the pronunciation of the /h/ sound focusing on words like 'hotel' and 'hospital.'",
          "timing": "10 minutes",
          "materials": "Slideshow with city images, projector, vocabulary handout"
        },
        {
          "stage": "Practice Activity",
          "procedure": "In pairs, ask students to pick two cities they know well (either from their own country or famous international cities) and make comparisons using comparative and superlative adjectives (e.g., 'New York is bigger than Boston, but Tokyo is the biggest.'). Circulate around the room to support students and correct any pronunciation issues with the /h/ sound.",
          "timing": "12 minutes",
          "materials": "City information handout or prompt sheet"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "Give students a short gap-fill exercise where they must complete sentences comparing three cities using the correct form of the adjectives provided. Focus on ensuring correct use of comparative and superlative adjectives. Review answers as a class.",
          "timing": "10 minutes",
          "materials": "Gap-fill worksheet"
        },
        {
          "stage": "Review",
          "procedure": "Recap the lesson by asking students to provide examples of comparisons. Encourage them to use places in their local city and another city. Highlight any common pronunciation issues with the /h/ sound noticed during the class, and model proper pronunciation again if necessary.",
          "timing": "5 minutes",
          "materials": "Whiteboard, markers, students' examples"
        },
        {
          "stage": "Closing",
          "procedure": "Provide an overview of the next lesson. Tell students they will expand on what they learned today by writing about their local city. Ask students for any final questions on today's material. Encourage them to incorporate today's vocabulary and grammar lesson in their daily routines.",
          "timing": "3 minutes",
          "materials": "None"
        },
        {
          "stage": "Homework",
          "procedure": "Assign a short writing task: students should write an email to a friend recommending a city in their country. They should compare it with another city and use at least 3 comparative adjectives and 1 superlative adjective in their email.",
          "timing": "After class",
          "materials": "Homework instructions handout"
        }
      ]
    }
  },
  {
    "lessonPlan": {
      "lesson": "Week 2 Lesson 3",
      "date": "12 November 2024",
      "time": "13:00-13:50",
      "topic": "Getting around",
      "vocabulary": "Means of transport",
      "grammar": "comparisons 'as...as', 'too', 'enough'",
      "listeningSpeaking": "Listen for specific information",
      "writing": "Buy a train ticket",
      "lessonObjective": "By the end of the lesson, students will be able to identify and use vocabulary related to means of transport, compare objects and people using 'as...as', 'too', 'enough', and practice listening for specific details in practical situations like buying a train ticket.",
      "stages": [
        {
          "stage": "Warmup",
          "procedure": "Begin with a brief discussion: ask students how they typically get to different places (e.g., school, work, or vacation spots). Introduce some key forms of transport (bus, train, car, bicycle, etc.).",
          "timing": "5 minutes",
          "materials": "Whiteboard, marker"
        },
        {
          "stage": "Introduction",
          "procedure": "Introduce the lesson topic: 'Getting Around'. Explain the vocabulary focus: 'Means of transport' and grammar focus: 'as...as', 'too', 'enough'. Ask students for some initial ideas on where comparisons might be useful (e.g., comparing transport methods).",
          "timing": "7 minutes",
          "materials": "Whiteboard, transport images"
        },
        {
          "stage": "Practice Activity",
          "procedure": "Listening practice: Play an audio recording of someone buying a train ticket and ask students to listen for specific information (e.g., ticket price, destination, time). After listening, ask comprehension questions (e.g., 'How much was the ticket?', 'Which transport did they use?').",
          "timing": "10 minutes",
          "materials": "Audio clip (buying a train ticket), laptop/speaker"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "Pair students up for a role-play activity: one buys a train ticket, the other is the ticket seller. Incorporate the use of appropriate comparisons using 'as...as', 'too', and 'enough' (e.g., 'This ticket is too expensive.', 'This train is as fast as the bus.').",
          "timing": "15 minutes",
          "materials": "Role-play dialogues, small conversation cards"
        },
        {
          "stage": "Review",
          "procedure": "Review the grammar structures. Have students compare the different modes of transport covered earlier using the target grammar, either orally or in writing. Example: 'A bus is not as fast as a car,' 'The train is too slow,' 'We have enough routes by bus.'",
          "timing": "7 minutes",
          "materials": "Whiteboard, comparison sentences"
        },
        {
          "stage": "Closing",
          "procedure": "Wrap up by asking a few students to share their sentences or role-play dialogues using the vocabulary and grammar. Provide feedback and correct any mistakes.",
          "timing": "4 minutes",
          "materials": "None"
        },
        {
          "stage": "Homework",
          "procedure": "Assign a writing task: 'Buy a Train Ticket'. Students will write a short dialogue where they purchase a ticket using at least three comparative structures from today's lesson (i.e., as...as, too, enough).",
          "timing": "2 minutes",
          "materials": "Printed assignment sheet or LMS post"
        }
      ]
    }
  },
  {
    "lessonPlan": {
      "lesson": "Week 2 Lesson 4",
      "date": "15 November 2024",
      "time": "13:50-14:40",
      "topic": "Busy bees",
      "vocabulary": "Chores",
      "grammar": "have to",
      "listeningSpeaking": "Listen for details",
      "writing": "Sentences about chores",
      "lessonObjective": "By the end of this lesson, students will be able to use 'have to' to talk about daily chores, demonstrate understanding in listening for details about chores, and write simple sentences explaining what chores they are responsible for.",
      "stages": [
        {
          "stage": "Warmup",
          "procedure": "To start off, the teacher asks students casual questions such as 'What chores do you do at home?' to activate prior knowledge and get students thinking about the day's topic. Encourage students to respond in pairs or small groups.",
          "timing": "5 minutes",
          "materials": "Whiteboard, markers"
        },
        {
          "stage": "Introduction",
          "procedure": "Introduce the vocabulary words related to chores (e.g., wash dishes, take out the trash, vacuum). Write the words on the board and ask students to repeat them after you. Use images or flashcards to make it more visual.",
          "timing": "8 minutes",
          "materials": "Chore flashcards or images, whiteboard, markers"
        },
        {
          "stage": "Practice Activity",
          "procedure": "Play an audio clip where different people talk about the chores they 'have to' do at home. Ask students to listen carefully and take notes on which chores are mentioned. Discuss as a class what chores they heard.",
          "timing": "10 minutes",
          "materials": "Audio player, chore listening task handouts"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "Provide a worksheet with gaps where students need to fill in the correct form of 'have to' and match it with the appropriate chore (e.g., I ____ [have to] sweep the floor every Sunday). Go over the answers together when finished.",
          "timing": "12 minutes",
          "materials": "Fill-in-the-blank worksheet, whiteboard, markers"
        },
        {
          "stage": "Review",
          "procedure": "Review the use of 'have to' by having students work with a partner. Each student takes turns using 'have to' in sentences discussing household chores they or their partner do, reinforcing the key structure from the lesson.",
          "timing": "8 minutes",
          "materials": "None (peer conversation)"
        },
        {
          "stage": "Closing",
          "procedure": "Ask a few students to share what chores they 'have to' do at home as a wrap-up activity. Summarize the key grammar and vocabulary from the lesson.",
          "timing": "5 minutes",
          "materials": "None"
        },
        {
          "stage": "Homework",
          "procedure": "For homework, instruct students to write five sentences using 'have to' to describe chores they perform at home. Optionally, they can draw pictures for each sentence to make it fun.",
          "timing": "2 minutes",
          "materials": "Homework instruction sheet"
        }
      ]
    }
  },
  {
    "lessonPlan": {
      "lesson": "Week 3 Lesson 5",
      "date": "19 November 2024",
      "time": "13:00-13:50",
      "topic": "School life",
      "vocabulary": "School rules",
      "grammar": "must/mustn't",
      "listeningSpeaking": "Pronunciation of must and mustn't",
      "writing": "A short list of school chores",
      "lessonObjective": "By the end of the lesson, students will be able to use must and mustn't to describe school rules and chores. They will also improve their pronunciation and create a short list of their own school chores.",
      "stages": [
        {
          "stage": "Warmup",
          "procedure": "Begin by asking students about their general experiences in school. Prompt them to share a few common school rules they already know. Encourage students to guess whether certain behaviors are allowed or forbidden.",
          "timing": "5 minutes",
          "materials": "None"
        },
        {
          "stage": "Introduction",
          "procedure": "Introduce the topic of school rules. Write a few rules on the board such as 'You must wear your uniform.' and 'You mustn't run in the halls.'. Emphasize must for obligations and mustn't for prohibitions. Focus briefly on how the pronunciation changes between must and mustn't.",
          "timing": "10 minutes",
          "materials": "Whiteboard, marker"
        },
        {
          "stage": "Practice Activity",
          "procedure": "Engage students in a pair discussion. Each pair should create 3 'must' rules and 3 'mustn't' rules based on their own school life experiences. Once finished, each pair will share their rules with the class.",
          "timing": "10 minutes",
          "materials": "Student notebooks, pen/pencil"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "Play an audio recording focused on the correct pronunciation of must and mustn't in various contexts. After listening, have students repeat aloud in groups or individually. Reinforce correct intonation and rhythm.",
          "timing": "10 minutes",
          "materials": "Audio recording, speakers"
        },
        {
          "stage": "Review",
          "procedure": "Review the rules created during the practice activities. Ask the class for corrections or suggestions on other ways to phrase the rules. Briefly test a few students on when to use must vs. mustn't.",
          "timing": "7 minutes",
          "materials": "Whiteboard with written rules"
        },
        {
          "stage": "Closing",
          "procedure": "Summarize the grammar point and vocabulary covered during the lesson. Highlight key takeaways such as when to use must/mustn't. Encourage students to practice using similar rules at home.",
          "timing": "5 minutes",
          "materials": "Whiteboard, marker"
        },
        {
          "stage": "Homework",
          "procedure": "For homework, ask students to write a short list of 5 chores they 'must' do and 5 they 'mustn't' do around their home (or in school). This will reinforce their understanding of the lesson content.",
          "timing": "3 minutes",
          "materials": "Homework sheet or assignment details on board"
        }
      ]
    }
  },
  {
    "lessonPlan": {
      "lesson": "Week 3 Lesson 6",
      "date": "22 November 2024",
      "time": "13:50-14:40",
      "topic": "Survival",
      "vocabulary": "Accidents, survival ties",
      "grammar": "should/shouldn't",
      "listeningSpeaking": "Give advice",
      "writing": "Sentences about how to use the internet safely",
      "lessonObjective": "Students will learn survival-related vocabulary, practice giving advice using 'should' and 'shouldn't,' and apply this knowledge to discuss internet safety while writing sentences and participating in speaking activities.",
      "stages": [
        {
          "stage": "Warmup",
          "procedure": "Begin with a discussion about survival situations. Ask students if they have ever been in a potentially dangerous situation and what they think they should or shouldn't do to survive.",
          "timing": "5 minutes",
          "materials": "None"
        },
        {
          "stage": "Introduction",
          "procedure": "Introduce the grammar focus 'should/shouldn't' by showing examples of advice related to survival situations, e.g., 'You should bring water' or 'You shouldn't panic.' Elicit more examples from students.",
          "timing": "10 minutes",
          "materials": "Whiteboard, markers"
        },
        {
          "stage": "Practice Activity",
          "procedure": "Students work in pairs or small groups. Each group receives a different survival scenario (e.g., getting lost in the forest, experiencing an earthquake). They must list what they should and shouldn’t do in those situations using the target grammar.",
          "timing": "10 minutes",
          "materials": "Survival scenario cards"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "The class will listen to a dialogue where two people give each other advice about surviving an emergency. After listening, students will summarize what advice was given, paying attention to the correctly used 'should' and 'shouldn't'.",
          "timing": "10 minutes",
          "materials": "Audio recording, script"
        },
        {
          "stage": "Review",
          "procedure": "Review the vocabulary related to survival. Write the key words (accidents, survival ties) on the board and ask students to create sentences using these words along with should/shouldn't.",
          "timing": "8 minutes",
          "materials": "Whiteboard, flashcards"
        },
        {
          "stage": "Closing",
          "procedure": "Summarize the lesson by asking students to share one piece of advice about safety when using the internet. Use the structure 'You should/shouldn't...' to reinforce the grammar point.",
          "timing": "5 minutes",
          "materials": "None"
        },
        {
          "stage": "Homework",
          "procedure": "Assign students to write 5 sentences about how to use the internet safely, using 'should' and 'shouldn't' and incorporating some of the survival vocabulary from the lesson.",
          "timing": "2 minutes",
          "materials": "Homework sheet or online submission platform"
        }
      ]
    }
  },
  {
    "lessonPlan": {
      "lesson": "Week 4 Lesson 7",
      "date": "26 November 2024",
      "time": "13:00-13:50",
      "topic": "Save the Earth",
      "vocabulary": "Environmental problems",
      "grammar": "should/shouldn't",
      "listeningSpeaking": "Make suggestions",
      "writing": "An email suggesting ways to help protect the environment",
      "lessonObjective": "Students will learn vocabulary related to environmental problems, practice making suggestions using 'should/shouldn't', and apply this knowledge in discussions and a short written activity to suggest ways to help protect the planet.",
      "stages": [
        {
          "stage": "Warmup",
          "procedure": "Begin the lesson by asking students about current environmental issues such as climate change, pollution, and deforestation. Display some images of environmental problems to prompt discussion and engage students in brainstorming solutions.",
          "timing": "5 minutes",
          "materials": "Images of environmental problems (e.g., deforestation, pollution), whiteboard"
        },
        {
          "stage": "Introduction",
          "procedure": "Introduce the vocabulary of the lesson by writing key words on the board (e.g., pollution, recycling, renewable energy). Explain and model pronunciation. Then, introduce and explain the grammar point 'should/shouldn't' in the context of environmental problems (e.g., 'We should recycle more', 'People shouldn't waste water').",
          "timing": "10 minutes",
          "materials": "Whiteboard, markers, vocabulary handout"
        },
        {
          "stage": "Practice Activity",
          "procedure": "Students work in pairs to brainstorm solutions for various environmental problems using 'should' and 'shouldn't'. Provide problem prompts (e.g., 'What should we do about plastic waste?', 'What shouldn't we do when it comes to saving water?'). After 5 minutes, ask a few pairs to share their suggestions with the class.",
          "timing": "15 minutes",
          "materials": "Problem prompt handouts, markers, whiteboard"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "Students will complete a short gap-fill exercise where they’ll fill in sentences related to environmental actions using 'should' or 'shouldn't'. For example, 'We ____ (should/shouldn’t) conserve water'.",
          "timing": "10 minutes",
          "materials": "Gap-fill worksheet"
        },
        {
          "stage": "Review",
          "procedure": "Review the key vocabulary and grammar by asking the class to provide one or two sentences they wrote during the practice, using 'should' and 'shouldn't' with environmental problems. Provide corrective feedback as needed.",
          "timing": "5 minutes",
          "materials": "Whiteboard, markers"
        },
        {
          "stage": "Closing",
          "procedure": "Wrap up the lesson by summarizing the main points: key vocabulary, using 'should' and 'shouldn't' to make suggestions, and the importance of small steps to protect the environment. Prompt students to share one action they will personally take to help the environment.",
          "timing": "3 minutes",
          "materials": "None"
        },
        {
          "stage": "Homework",
          "procedure": "Assign a writing task: each student will write an email to a friend suggesting at least three ways they can help protect the environment in their daily lives. Remind them to use 'should' and 'shouldn't' in their suggestions.",
          "timing": "2 minutes",
          "materials": "Homework prompt handout or digital platform"
        }
      ]
    }
  },
  {
    "lessonPlan": {
      "lesson": "Week 4 Lesson 8",
      "date": "29 November 2024",
      "time": "13:50-14:40",
      "topic": "Eco-tourism",
      "vocabulary": "Eco-tourism activities",
      "grammar": "be going to",
      "listeningSpeaking": "Talk about weekend plans",
      "writing": "Sentences about weekend plans",
      "lessonObjective": "Students will be able to use the future tense ('be going to') to discuss and write about plans for eco-tourism activities, while expanding their vocabulary related to eco-sustainable travel choices.",
      "stages": [
        {
          "stage": "Warmup",
          "procedure": "Start with a brief discussion on weekend plans. Ask students to share where they personally like to go on weekends and why. Build anticipation by teasing today’s topic of eco-tourism activities.",
          "timing": "5 minutes",
          "materials": "Whiteboard, markers"
        },
        {
          "stage": "Introduction",
          "procedure": "Introduce the concept of eco-tourism by explaining the environmental, social, and cultural advantages of sustainable tourism practices. Show examples of eco-tourism activities like hiking, visiting national parks, or staying at eco-lodges. Write key vocabulary words on the board.",
          "timing": "8 minutes",
          "materials": "Slides with images of eco-tourism activities, whiteboard, projector"
        },
        {
          "stage": "Practice Activity",
          "procedure": "Students work in pairs to discuss where they would like to go for an eco-tourism trip. They should use the vocabulary introduced (e.g., hiking, wildlife exploration) and the structure 'I am going to...' to share their plans aloud. Encourage students to ask follow-up questions using 'going to.'",
          "timing": "10 minutes",
          "materials": "Eco-tourism vocabulary worksheet, conversation prompts"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "Students complete a worksheet where they match eco-tourism activities with correct descriptions (vocabulary drill). Then, write five sentences describing their own plan for an upcoming eco-tourism weekend using ‘be going to' for practice.",
          "timing": "12 minutes",
          "materials": "Printed worksheets (vocabulary match and sentence-writing exercise), pens"
        },
        {
          "stage": "Review",
          "procedure": "Invite students to share their written sentences (about weekend eco-tourism plans) with the class. Provide feedback on their use of 'be going to' and correct any vocabulary usage mistakes.",
          "timing": "7 minutes",
          "materials": "Student written sentences, whiteboard for corrections"
        },
        {
          "stage": "Closing",
          "procedure": "Summarize key vocabulary and grammar points covered in the lesson: eco-tourism activities and 'be going to.' Invite last-minute questions, ensuring students are confident with the structure and the new vocabulary. Praise participation.",
          "timing": "5 minutes",
          "materials": "Whiteboard, summary slide"
        },
        {
          "stage": "Homework",
          "procedure": "Assign students a small writing task to describe detailed weekend plans involving a nearby eco-tourism destination. They should write at least 5 sentences using ‘be going to’ and incorporate two or more new eco-tourism vocabulary words from the lesson.",
          "timing": "1 minute",
          "materials": "Homework instructions handout"
        }
      ]
    }
  },
  {
    "lessonPlan": {
      "lesson": "Week 5 Lesson 9",
      "date": "3 December 2024",
      "time": "13:00-13:50",
      "topic": "In days to come",
      "vocabulary": "Future events",
      "grammar": "will",
      "listeningSpeaking": "expressing uncertainty",
      "writing": "Predictions about the future",
      "lessonObjective": "By the end of the lesson, students should be able to use the modal verb 'will' to make predictions about future events and express uncertainty in spoken and written form.",
      "stages": [
        {
          "stage": "Warmup",
          "procedure": "Begin with a brief class discussion on recent changes in technology or world events. Ask students to speculate what the world will be like in 10 or 20 years to introduce future predictions.",
          "timing": "5 minutes",
          "materials": "Whiteboard, markers"
        },
        {
          "stage": "Introduction",
          "procedure": "Introduce the grammar point by explaining the use of 'will' to make predictions about the future. Provide examples such as 'It will rain tomorrow' and 'Technology will improve our lives'. Write these on the board and highlight the function of 'will'.",
          "timing": "10 minutes",
          "materials": "Whiteboard, markers"
        },
        {
          "stage": "Practice Activity",
          "procedure": "In pairs, have students create predictions using 'will' about specific topics like technology, education, and health. Each pair should come up with 3–5 predictions. Walk around and monitor the discussion, providing assistance where necessary.",
          "timing": "10 minutes",
          "materials": "None (students in pairs)"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "Complete a worksheet where students fill in the blanks with the correct use of 'will' in context. Example sentences may include 'In 50 years, people _____ live on Mars.' Ensure the sentences are related to future events.",
          "timing": "10 minutes",
          "materials": "Printed worksheet"
        },
        {
          "stage": "Review",
          "procedure": "Review the completed worksheets as a class. Call on individual students to provide the answers, and correct any mistakes by eliciting responses from peers. Also, reinforce the uses of 'will' when expressing uncertainty.",
          "timing": "5 minutes",
          "materials": "Completed worksheets, whiteboard, markers"
        },
        {
          "stage": "Closing",
          "procedure": "Conclude the lesson by asking students to give one prediction each about the future using 'will'. Encourage them to use vocabulary related to future events and express a degree of uncertainty if applicable.",
          "timing": "5 minutes",
          "materials": "None"
        },
        {
          "stage": "Homework",
          "procedure": "Assign a writing task where students write a short paragraph (4-6 sentences) predicting what the world will be like in 2050, incorporating 'will' and expressing uncertainty where possible.",
          "timing": "Homework",
          "materials": "Instruction handout or digital assignment"
        }
      ]
    }
  },
  {
    "lessonPlan": {
      "lesson": "Week 5 Lesson 10",
      "date": "6 December 2024",
      "time": "13:50-14:40",
      "topic": "What will be, will be",
      "vocabulary": "Stages of life",
      "grammar": "will, be going to",
      "listeningSpeaking": "expressing uncertainty",
      "writing": "A blog about your future",
      "lessonObjective": "By the end of the lesson, students will be able to confidently use 'will' and 'be going to' to discuss future plans and uncertainties, utilizing vocabulary related to life stages in both speaking and writing activities.",
      "stages": [
        {
          "stage": "Warmup",
          "procedure": "Engage the students in a brief discussion about the future. Ask questions like 'What do you think will happen next year?' or 'Are there any big plans you have for the next few months?' Get students thinking about future events and uncertainty, introducing the theme of expressing uncertainty.",
          "timing": "5 minutes",
          "materials": "None"
        },
        {
          "stage": "Introduction",
          "procedure": "Introduce the grammar points ('will' and 'be going to') on the board. Explain the difference between using 'will' for spontaneous decisions or predictions, and 'going to' for planned events. Use real-life examples that incorporate vocabulary from stages of life, such as 'I will retire when I’m 65' and 'She is going to start college next year.' Have the students provide their own examples.",
          "timing": "10 minutes",
          "materials": "Whiteboard, markers"
        },
        {
          "stage": "Practice Activity",
          "procedure": "Hand out a worksheet where students must match sentences to the correct usage of 'will' or 'going to'. The sentences will include vocabulary connected to stages of life (e.g., 'be born,' 'graduate,' 'get married'). After completing the worksheet, have students discuss their answers with a partner.",
          "timing": "10 minutes",
          "materials": "Worksheet with future-tense sentence exercises"
        },
        {
          "stage": "Controlled Practice",
          "procedure": "In pairs, have students role-play a conversation about their future. One student will express their certainty about future events ('I am going to start a new job next month') and the other will respond with uncertainty ('I think I will move to another city in the future'). Encourage them to use vocabulary related to life stages.",
          "timing": "10 minutes",
          "materials": "Sample conversation script (optional)"
        },
        {
          "stage": "Review",
          "procedure": "Bring the class back together to review the differences between 'will' and 'going to'. Call on volunteers to share their role-play conversations and highlight any useful new vocabulary related to life stages. Remind students of how to use these structures to express certainty or uncertainty about future events.",
          "timing": "5 minutes",
          "materials": "None"
        },
        {
          "stage": "Closing",
          "procedure": "Summarize the key points of the lesson: the usage of 'will' and 'going to', as well as some of the stages of life vocabulary. Ask for any final questions or doubts, and provide a quick example of how they can use this grammar for their upcoming writing assignment.",
          "timing": "5 minutes",
          "materials": "Whiteboard, markers"
        },
        {
          "stage": "Homework",
          "procedure": "Assign students to write a blog post about their future in 200-250 words. Instruct them to use 'will' and 'going to' in their writing to explain future plans (real or imagined), and include at least three pieces of vocabulary related to stages of life.",
          "timing": "Homework",
          "materials": "Blog assignment instructions"
        }
      ]
    }
  }
]
